Revit 2027 API
XYZ.TripleProduct Method
The triple product of this vector and the two specified vectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TripleProduct(
	XYZ middle,
	XYZ right
)
Public Function TripleProduct (
	middle As XYZ,
	right As XYZ
) As Double
public:
double TripleProduct(
	XYZ^ middle,
	XYZ^ right
)
member TripleProduct :
        middle : XYZ *
        right : XYZ -> float
Parameters
middle XYZ
The second vector.
right XYZ
The third vector.
Return Value
Double
The real number equal to the triple product.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when middle or right is null.
Remarks
 The scalar triple product is defined as the dot product of one of the vectors with the cross product of the other two. Geometrically, this product is the (signed) volume of the parallelepiped formed by the three vectors given.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace